[{"text": "WIshing everyone a happy, healthy and prosperous New Year!", "date": "30 Dec 2010", "retweet": false, "id": "20595488004775936"}, {"text": "Wishing everyone a very Happy Holiday season!", "date": "23 Dec 2010", "retweet": false, "id": "17979321264115714"}, {"text": "Don't forget to watch Larry King tonight, CNN at 9 pm.  He's a television legend and a great friend. It's going to be a fantastic farewell.", "date": "16 Dec 2010", "retweet": false, "id": "15413432119459840"}, {"text": "I'll be appearing on Larry King Live for his final show, Thursday night at 9 p.m., CNN. Larry's been on TV for 25 years...", "date": "14 Dec 2010", "retweet": false, "id": "14785576859340800"}, {"text": "All the hotels currently open in the Trump Hotel Collection have been nominated for Travel & Leisure's \"World's Best Awards 2011\" .....", "date": "13 Dec 2010", "retweet": false, "id": "14356570783617025"}, {"text": "Congratulations to Brandy as our new Apprentice and to Clint for being a great player. It's been a terrific season!", "date": "10 Dec 2010", "retweet": false, "id": "13242093694623744"}, {"text": "Tonight is the Apprentice finale---and it's a fantastic episode in every way, with the great Liza Minnelli performing and a new Apprentice!", "date": "9 Dec 2010", "retweet": false, "id": "12960183131045888"}, {"text": "My best wishes to everyone for a Happy Thanksgiving!", "date": "24 Nov 2010", "retweet": false, "id": "7504103261347840"}, {"text": "Watch CNN tomorrow at 2 pm & 5 pm and on Friday at 7 pm & 11 pm for a Thanksgiving Special hosted by John King. I'll be a featured guest.", "date": "24 Nov 2010", "retweet": false, "id": "7461789721698304"}, {"text": "Staff Sgt. Salvatore A. Giunta received the Medal of Honor from Pres. Obama this month. It was a great honor to have him visit me today.", "date": "22 Nov 2010", "retweet": false, "id": "6759410504310784"}, {"text": "\"CNBC Titans: Donald Trump \" will be shown Friday Nov 19th at 9 pm and 1 am, Sunday 11/21 at 9 pm and  11/24 at 7 pm   http://bit.ly/ckojPN", "date": "18 Nov 2010", "retweet": false, "id": "5307138364674048"}, {"text": "My interview last week with Greta van Susteren is available here in slightly abridged form. http://bit.ly/96ztOA  Good info to know about.", "date": "15 Nov 2010", "retweet": false, "id": "4257859944579073"}, {"text": "An HR solutions company polled 1,000 employed adults to find out who would make ideal bosses...   http://bit.ly/9uP9vj", "date": "14 Oct 2010", "retweet": false, "id": "27362772649"}, {"text": "Be sure to watch The Apprentice tonight, 10 p.m. on NBC--it's an episode you won't forget!", "date": "14 Oct 2010", "retweet": false, "id": "27343104700"}, {"text": "I'm honored to be presented the award of Doctor of Business Administration Honoris Causa from Robert Gordon University in Aberdeen, Scotland", "date": "6 Oct 2010", "retweet": false, "id": "26551913010"}, {"text": "Tune in tonight at 10 pm on NBC for another exciting episode of The Apprentice -- and see the Dog Whisperer make an appearance.", "date": "30 Sep 2010", "retweet": false, "id": "25988176664"}, {"text": "See the new sizzle reel for The Apprentice   http://bit.ly/ax8nah", "date": "24 Sep 2010", "retweet": false, "id": "25436192384"}, {"text": "Don't forget to tune in tonight for the two hour premiere of The Apprentice. 9 pm EST on NBC. We're all in for a fantastic new season!", "date": "16 Sep 2010", "retweet": false, "id": "24673275254"}, {"text": "I am very happy to have the civilian version of \"The Apprentice\" back on the air this fall. There will be excitement as well as opportunity.", "date": "14 Sep 2010", "retweet": false, "id": "24508012246"}, {"text": "There's a lot going on at the Eric Trump Foundation ...  http://bit.ly/9rJ0sn", "date": "7 Sep 2010", "retweet": false, "id": "23259108430"}, {"text": "Check out Trump International Hotel & Tower New York --spectacular! http://www.trump.com/Hotel_Collection/Trump_New_york/Trump_New_York.asp", "date": "2 Sep 2010", "retweet": false, "id": "22812888292"}, {"text": "I'll be on The Late Show with David Letterman tonight--be sure to tune in for a great show. 11:30 pm on CBS.", "date": "1 Sep 2010", "retweet": false, "id": "22742724001"}, {"text": "Went to the Yankees game last night with Bill O'Reilly--we had a great time watching the Yankees win!", "date": "31 Aug 2010", "retweet": false, "id": "22644749933"}, {"text": "The Miss Universe Pageant raked in some great ratings!  A great job by everyone.", "date": "26 Aug 2010", "retweet": false, "id": "22207798183"}, {"text": "Congratulations to Miss Mexico, Jimena Navarrete, our new Miss Universe 2010, and congratulations to everyone for a fantastic show.", "date": "24 Aug 2010", "retweet": false, "id": "22003109005"}, {"text": "It's going to get hotter in Las Vegas tonight! Watch the Miss Universe Pageant tonight on NBC at 9 p.m. I'm looking forward to being there!", "date": "23 Aug 2010", "retweet": false, "id": "21915730688"}, {"text": "The original Apprentice returns with a two hour premiere on Thursday September 16th. Looking forward to a fantastic season!", "date": "19 Aug 2010", "retweet": false, "id": "21598934653"}, {"text": "Mark your calenders for August 23rd:  http://www.missuniverse.com/", "date": "9 Aug 2010", "retweet": false, "id": "20708393094"}, {"text": "Performing live on the Miss Universe Pageant from the Mandalay Bay Resort & Casino will be Telemundo, Orianthi, John Legend and The Roots.", "date": "4 Aug 2010", "retweet": false, "id": "20307691790"}, {"text": "The Miss Universe Pageant will be on August 23 (9-11 p.m. on NBC, ET) with Bret Michaels and Natalie Morales to co-host, live from Las Vegas", "date": "4 Aug 2010", "retweet": false, "id": "20307423177"}, {"text": "Enter the contest....http://www.facebook.com/sertamattress...and stay at Trump International Hotel Las Vegas", "date": "30 Jul 2010", "retweet": false, "id": "19918744500"}, {"text": "I'm helping the Serta Counting Sheep get back to work. Enter the contest http://www.facebook.com/sertamattress and win a trip to Las Vegas..", "date": "29 Jul 2010", "retweet": false, "id": "19855081470"}, {"text": "I'm proud to accept the 2010 HollyRod Foundation Humanitarian Award from Holly Robinson Peete, who raised $700,000 on Celebrity Apprentice", "date": "20 Jul 2010", "retweet": false, "id": "19000595542"}, {"text": "George Steinbrenner was a great friend and a true legend. There will never be anyone like him in New York. We've lost a truly great man.", "date": "14 Jul 2010", "retweet": false, "id": "18531733257"}, {"text": "The new edition of The Apprentice will be on Thursdays this fall at 10 pm ET---I'm putting people back to work!", "date": "6 Jul 2010", "retweet": false, "id": "17872565508"}, {"text": "Due to popular demand, CNN will re-broadcast  the Larry King Live show I hosted in June, in which I interview Larry. Monday July 5, 9 pm CNN", "date": "2 Jul 2010", "retweet": false, "id": "17580961111"}, {"text": "Wishing everyone a wonderful Independence Day weekend. We have a lot to be thankful for.", "date": "2 Jul 2010", "retweet": false, "id": "17572473837"}, {"text": "Work is expected to begin today on my golf course in Scotland. It will be spectacular! http://bit.ly/blp1Tq", "date": "1 Jul 2010", "retweet": false, "id": "17494917112"}, {"text": "\"Trading Shots with Donald Trump\"--a great article in the Wall Street Journal\nhttp://bit.ly/c9eZbq", "date": "28 Jun 2010", "retweet": false, "id": "17254625071"}, {"text": "Great job on the Larry King Live Gulf Telethon last night--$1.3 million was raised in 2 hours.", "date": "22 Jun 2010", "retweet": false, "id": "16781267906"}, {"text": "The Ultimate Merger:  http://www.nydailynews.com/entertainment/tv/2010/06/17/2010-06-17_omarosa_is_back_and_this_time_its_personal.html", "date": "17 Jun 2010", "retweet": false, "id": "16393566152"}, {"text": "Tune in tonight at 9 pm on TV One for \"The Ultimate Merger\" starring the one and only Omarosa and twelve brave bachelors ...", "date": "17 Jun 2010", "retweet": false, "id": "16393424310"}, {"text": "Tonight I trade places with Larry King @kingsthings and interview him on the 25th anniversary of his show. 9PM on CNN featuring best clips.", "date": "5 Jun 2010", "retweet": false, "id": "15518022208"}, {"text": "Be sure to watch the Larry King Show tomorrow night on CNN, 9 p.m. I'll be the host, Larry the guest. http://larrykinglive.blogs.cnn.com/", "date": "4 Jun 2010", "retweet": false, "id": "15433442939"}, {"text": "I'll be turning the table on Larry King this Saturday night.  I'll be interviewing him in honor of the 25th Anniversary of his show.", "date": "2 Jun 2010", "retweet": false, "id": "15275512684"}, {"text": "Wishing everyone a Happy Memorial Day Weekend, with a special thought for all the veterans who have done so much for our freedom.", "date": "28 May 2010", "retweet": false, "id": "14917052148"}, {"text": "Scotland is beautiful. I spent several years looking for the right place, visiting over 200 sites, and this is absolutely the right place!", "date": "26 May 2010", "retweet": false, "id": "14764340745"}, {"text": "Ivanka caught up with Bret and Holly backstage. Both Bret and Holly were champions all the way.   http://bit.ly/ckmKKU", "date": "25 May 2010", "retweet": false, "id": "14691984203"}, {"text": "Congratulations to Bret Michaels, the new Celebrity Apprentice. Bret's a true champion, all of us were happy to see him and to see him win!", "date": "24 May 2010", "retweet": false, "id": "14628551705"}, {"text": "The latest update on Bret Michaels is that he's making every effort to attend the live finale of Celebrity Apprentice on Sunday--so tune in!", "date": "20 May 2010", "retweet": false, "id": "14371483646"}, {"text": "Put  this on your calendar: The Celebrity Apprentice live finale is this Sunday at 9 p.m. on NBC. Who will be the next Celebrity Apprentice?", "date": "19 May 2010", "retweet": false, "id": "14305093521"}, {"text": "Congratulations to our new Miss USA,  the beautiful Rima Fakih.  Rima will represent us well at Miss Universe and be a wonderful Miss USA .", "date": "17 May 2010", "retweet": false, "id": "14171725850"}, {"text": "Looking forward to the 2010 Miss USA Pageant, Sunday May 16 on NBC, 7 p.m. ET, hosted by Curtis Stone & Natalie Morales live from Las Vegas.", "date": "13 May 2010", "retweet": false, "id": "13936645875"}, {"text": "We're all very happy to hear of Bret Michael's progress and send our best wishes for his full recovery.", "date": "5 May 2010", "retweet": false, "id": "13444373897"}, {"text": "Melania and I will be appearing on Larry King Live tonight, 9 p.m. on CNN. Be sure to tune in for some great conversation!", "date": "28 Apr 2010", "retweet": false, "id": "13008593779"}, {"text": "Our thoughts and prayers remain with Bret Michaels and his family and for his speedy recovery.", "date": "26 Apr 2010", "retweet": false, "id": "12884286007"}, {"text": "To put on your calendar for May: Miss USA 2010, live from Las Vegas on May 16th, 7 p.m. ET on NBC. I'll be there--tune in for a great show!", "date": "23 Apr 2010", "retweet": false, "id": "12707966134"}, {"text": "Melania and I will be appearing on The View tomorrow at 11 a.m. on CBS. Tune in for some great fun!", "date": "22 Apr 2010", "retweet": false, "id": "12642103351"}, {"text": "Tune in to The Marriage Ref onThursday night at 10 p.m. on NBC--I'm on the panel of experts along with Gloria Estefan & Adam Carolla.", "date": "20 Apr 2010", "retweet": false, "id": "12535153342"}, {"text": "\"Before Kids Can Go Places, They Need a Place To Go\" -- the motto of The Police Athletic League, an organization I'm  very proud to support", "date": "14 Apr 2010", "retweet": false, "id": "12183298109"}, {"text": "Looking forward to seeing the World Champion Yankees today on opening day!", "date": "13 Apr 2010", "retweet": false, "id": "12104502409"}, {"text": "The premiere of \"Donald J. Trump's Fabulous World of Golf\" is tomorrow night at 9 p.m.\nET on Golf Channel. Tune in for a great adventure!", "date": "12 Apr 2010", "retweet": false, "id": "12057473512"}, {"text": "This is a terrific day for downtown New York. Trump SoHo is unlike anything else. Be sure to visit this fantastic hotel soon!", "date": "9 Apr 2010", "retweet": false, "id": "11889453121"}, {"text": "Trump SoHo opens this Friday and it is fantastic! Check out the Trump Hotel Collection...\nhttp://www.trump.com/", "date": "7 Apr 2010", "retweet": false, "id": "11782136751"}, {"text": "My bestselling book from last April, Think Like a Champion, is now available in paperback. It's inspiring, entertaining, and a great read.", "date": "6 Apr 2010", "retweet": false, "id": "11710963303"}, {"text": "Today's open call drew thousands of  eager applicants. It was an impressive group,  I enjoyed meeting them. We've got some great candidates!", "date": "1 Apr 2010", "retweet": false, "id": "11439299597"}, {"text": "Don't forget the open call at Trump Tower tomorrow for The Apprentice. I look forward to seeing you there.", "date": "31 Mar 2010", "retweet": false, "id": "11366768299"}, {"text": "The NYC casting call for The Apprentice is thisThursday, April 1 at Trump Tower. For all the information you need, go to NBC.com/casting.", "date": "29 Mar 2010", "retweet": false, "id": "11266002473"}, {"text": "The original Apprentice is coming back--do you have what it takes to be the next Apprentice? For casting details: http://tinyurl.com/yly2c8u", "date": "24 Mar 2010", "retweet": false, "id": "10988912416"}, {"text": "The Trump Hotel Collection is currently nominated for Conde Nast Traveler Readers Choice Awards, Travel & Leisure and World Travel Awards.", "date": "23 Mar 2010", "retweet": false, "id": "10932826995"}, {"text": "Last week's episode of the Celebrity Apprentice set the stage for a great new season. Tune in this Sunday on NBC for even more excitement.", "date": "19 Mar 2010", "retweet": false, "id": "10723856371"}, {"text": "I am happy to announce that theoriginal Apprentice --which will offer job opportunities to those in need--is coming back.", "date": "18 Mar 2010", "retweet": false, "id": "10683036402"}, {"text": "Olympic Gold  Medalist Evan Lysacek just left my office. He is in town and wanted to meet me--he's a fanastic guy and a true champion.", "date": "17 Mar 2010", "retweet": false, "id": "10625708767"}, {"text": "The new season of the Celebrity Apprentice is off to a great start-- last night it swept the 10 p.m. hour in every key demographic.", "date": "15 Mar 2010", "retweet": false, "id": "10528960360"}, {"text": "The Celebrity Apprentice has a two-hour premiere this Sunday, March 14th, at 9 p.m. on NBC. This will be the best season yet, see you then!", "date": "12 Mar 2010", "retweet": false, "id": "10388634535"}, {"text": "From Donald Trump: Andrea Bocelli @ Mar-a-Lago - Many say best night of entertainment in long history of Palm Beach http://bit.ly/2fNgOz", "date": "5 Mar 2010", "retweet": false, "id": "10027087487"}, {"text": "From Donald Trump: “I’m so proud of my wife Melania and the launch of her new jewelry line, to debut on QVC on April 30th at 9 p.m.”", "date": "26 Feb 2010", "retweet": false, "id": "9696989458"}, {"text": "Donald Trump appeared on the final episode of The Jay Leno Show to deliver a very special message: http://bit.ly/cv1En7", "date": "11 Feb 2010", "retweet": false, "id": "8975219053"}, {"text": "Donald Trump appearing today on CNN International’s ‘Connect the World’ as ‘Connector of the Day’. Submit questions: http://bit.ly/bPiP7T", "date": "10 Feb 2010", "retweet": false, "id": "8905123688"}, {"text": "Superbowl Sunday is a great American tradition. The Colts and Saints are already champions, but may the best team win!", "date": "7 Feb 2010", "retweet": false, "id": "8770493686"}, {"text": "Golf Channel & Donald Trump's World of Golf host a Celebrity Match 1/25 @ TNGC LA, CA - Mark Wahlberg vs. Kevin Dillon http://bit.ly/4MubN6", "date": "22 Jan 2010", "retweet": false, "id": "8083871612"}, {"text": "from Donald Trump: \"I saw Lady Gaga last night and she was fantastic!\"", "date": "21 Jan 2010", "retweet": false, "id": "8033746720"}, {"text": "Trump Tycoon App for iPhone & iPod Touch - It's $2.99 but the advice is priceless! http://bit.ly/UGUF0", "date": "15 Jan 2010", "retweet": false, "id": "7793032738"}, {"text": "Celebrity Apprentice returns to NBC, Sunday, 3/14, 9-11PM ET/PT. Outstanding list of celebrities & season should be the best one yet!", "date": "12 Jan 2010", "retweet": false, "id": "7677152231"}]